spark-empty/crash-as/com/as.infrastructure/arch/mpc56xx/mcal/Can.c
/* -------------------------------- Arctic Core ------------------------------
 * Arctic Core - the open source AUTOSAR platform http://arccore.com
 *
 * Copyright (C) 2009  ArcCore AB <contact@arccore.com>
 *
 * This source code is free software; you can redistribute it and/or modify it
 * under the terms of the GNU General Public License version 2 as published by the
 * Free Software Foundation; See <http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt>.
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
 * or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
 * for more details.
 * -------------------------------- Arctic Core ------------------------------*/

/** @reqSettings DEFAULT_SPECIFICATION_REVISION=3.1.5 */

/* Code TODO
 * - REMOVE1
 * - REMOVE2
 * - Enable SOFT_RESET to guarantee that we get the same state every time
 *   (do in Can_InitController ?)
 */

/* ----------------------------[information]----------------------------------*/
/*
 * Author: mahi
 *
 * Part of Release:
 *   3.1.5
 *
 * Description:
 *   Implements the Can Driver module
 *
 * Support:
 *   General                  Have Support
 *   -------------------------------------------
 *   CAN_DEV_ERROR_DETECT            Y
 *   CAN_HW_TRANSMIT_CANCELLATION    N
 *   CAN_IDENTICAL_ID_CANCELLATION   N
 *   CAN_INDEX                       N
 *   CAN_MULTIPLEXED_TRANSMISSION    N
 *   CAN_TIMEOUT_DURATION            N
 *   CAN_VERSION_INFO_API            N
 *
 *   Controller                  Have Support
 *   -------------------------------------------
 *   CAN_BUSOFF_PROCESSING           N  , Interrupt only
 *   CAN_RX_PROCESSING               N  , Interrupt only
 *   CAN_TX_PROCESSING               N  , Interrupt only
 *   CAN_WAKEUP_PROCESSING           N  , Interrupt only
 *   CAN_CPU_CLOCK_REFERENCE         N  , *)
 *   CanWakeupSourceRef              N  , **)
 *
 *   *) It assumes that there is a PERIPHERAL clock defined.
 *   **) The flexcan hardware cannot detect wakeup (at least now the ones
 *       this driver supports)
 *
 *   Devices    CLK_SRC
 *   ----------------------------------------------
 *   MPC5604B   ?
 *   MPC5606S   Only sys-clk it seems
 *   MPC551x    Both sys-clk and XOSC, See 3.3
 *   MPC5567    ?
 *   MPC5668    ?
 *
 *   MPC5554 is NOT supported (no individual mask)
 *
 * Implementation Notes:
 *   - Individual RXMASKs are always ON. No support for "old" chips.
 *   FIFO
 *   - Is always ON.
 *   - Is masked ONLY against 8 extended IDs
 *   - Have depth 6, with 8 ID and 8 RXMASK
 *
 *   MBOX ALLOCATION
 *     RX
 *       - First 8 boxes always allocated for RX FIFO
 *       - software filter for RX FIFO, to identify the right HRH.
 *       - HRHs are global indexed from 00
 *     TX
 *       - One HTH for each HOH (the HOH can have a number of mailboxes, in sequence)
 *       - HTHs are global (at least for each driver) indexed from 0
 *
 *    EXAMPLE ALLOCATION
 *      0 ,
 *      1  |
 *      2  |
 *      3  |   RX FIFO -> software lookup to map to right HTH
 *      4  |              1 FULL_CAN    HOH_0
 *      5  |              1 BASIC_CAN   HOH_1
 *      6  |
 *      7 ,
 *
 *      8   RX FULL_CAN  -  HOH_2
 *      9   RX FULL_CAN  -  HOH_3
 *      10  RX BASIC_CAN  - HOH_4   |  RX with 2 boxes
 *      11                - HOH_4   |
 *      12  TX FULL_CAN   - HOH_5
 *      13  TX BASIC_CAN  - HOH_6   |  TX with 2 boxes
 *      14                - HOH_6   |
 *
 *    LOOKUP
 *      TX
 *        Can_Write(..) sends with HTH as argument. We need find the HOH first
 *        and then find one or more TX mailboxes.
 *      RX
 *        TODO.
 *
 *    RAM USAGE:
 *      A "Can Unit":
 *      - mbToHrh, max 64  (could be moved to const... but PB problems?)
 *      - swPduHandles, max 64*2
 *      Global:
 *      - Can_HthToUnitIdMap, Number of HTHs
 *      - Can_HthToHohMap, Number of HTHs

 *  64 + 64*2 = 192*2 =
 *
 *  OBJECT MODEL
 *
 *     Can_ControllerConfigType
 *     |--- Can_Arc_Hoh -->  CanHardwareObjectConfig_CTRL_A
 *
 *     CanHardwareObjectConfig_CTRL_A
 *     |--- CanObjectId
 *
 *
 *
 *
 * Things left:
 *   All tags. Tags only on public functions now.
 *
 */


/* ----------------------------[includes]------------------------------------*/
#include "Can.h"
#include <stdio.h>
#include "mpc56xx.h"
#include "Mcu.h"
#include "CanIf_Cbk.h"
#if defined(USE_DET)
#include "Det.h"
#endif
#if defined(USE_DEM)
#include "Dem.h"
#endif
#include <stdlib.h>
#include <string.h>
#include "Os.h"
#include "asdebug.h"

#ifndef ISR_INSTALL_ISR2
#include "IntcInterrupts.h"
#define ISR_INSTALL_ISR2(_name, _can_entry, _vector, _priority, _app) \
	INTC_InstallINTCInterruptHandler(_can_entry, _vector, _priority)
#endif
/* ----------------------------[private define]------------------------------*/

#define AS_LOG_CAN 1
#define MAX_NUM_OF_MAILBOXES    64
#ifdef USE_SHELL
#define USE_CAN_STATISTICS      STD_ON
#else
#define USE_CAN_STATISTICS      STD_OFF
#endif

// Message box status defines
#define MB_TX_ONCE              0xc
#define MB_INACTIVE             0x8
#define MB_RX                   0x4
#define MB_ABORT                0x9
#define MB_RX_OVERRUN           0x6

/* Registers */
#define ESR_ERRINT		(1<<1)

/* ----------------------------[private macro]-------------------------------*/

#define CTRL_TO_UNIT_PTR(_controller)   &CanUnit[Can_Global.config->CanConfigSet->ArcCtrlToUnit[_controller]]
#define VALID_CONTROLLER(_ctrl)         (Can_Global.configuredMask & (1<<(_ctrl)))
#define GET_CALLBACKS()                 (Can_Global.config->CanConfigSet->CanCallbacks)
#if defined(CFG_MPC5604P)
#define GET_CONTROLLER(_controller) 	\
        					((flexcan_t *)(0xFFFC0000 + 0x28000*(_controller)))
#else
#define GET_CONTROLLER(_controller) 	\
        					((flexcan_t *)(0xFFFC0000 + 0x4000*(_controller)))
#endif

#define INSTALL_HANDLER4(_name, _can_entry, _vector, _priority, _app)\
	do { \
		ISR_INSTALL_ISR2(_name, _can_entry, _vector+0, _priority, _app); \
		ISR_INSTALL_ISR2(_name, _can_entry, _vector+1, _priority, _app); \
		ISR_INSTALL_ISR2(_name, _can_entry, _vector+2, _priority, _app); \
		ISR_INSTALL_ISR2(_name, _can_entry, _vector+3, _priority, _app); \
	} while(0)

#define INSTALL_HANDLER16(_name, _can_entry, _vector, _priority, _app)\
	do { \
		INSTALL_HANDLER4(_name, _can_entry, _vector+0, _priority, _app); \
		INSTALL_HANDLER4(_name, _can_entry, _vector+4, _priority, _app); \
		INSTALL_HANDLER4(_name, _can_entry, _vector+8, _priority, _app); \
		INSTALL_HANDLER4(_name, _can_entry, _vector+12,_priority, _app); \
	} while(0)

//-------------------------------------------------------------------

#if ( CAN_DEV_ERROR_DETECT == STD_ON )
#define VALIDATE(_exp,_api,_err ) \
        if( !(_exp) ) { \
          Det_ReportError(MODULE_ID_CAN,0,_api,_err); \
          return CAN_NOT_OK; \
        }

#define VALIDATE_NO_RV(_exp,_api,_err ) \
        if( !(_exp) ) { \
          Det_ReportError(MODULE_ID_CAN,0,_api,_err); \
          return; \
        }

#define DET_REPORTERROR(_x,_y,_z,_q) Det_ReportError(_x, _y, _z, _q)
#else
#define VALIDATE(_exp,_api,_err )
#define VALIDATE_NO_RV(_exp,_api,_err )
#define DET_REPORTERROR(_x,_y,_z,_q)
#endif

#if defined(USE_DEM)
#define VALIDATE_DEM_NO_RV(_exp,_err ) \
        if( !(_exp) ) { \
          Dem_ReportErrorStatus(_err, DEM_EVENT_STATUS_FAILED); \
          return; \
        }
#else
#define VALIDATE_DEM_NO_RV(_exp,_err )
#endif


/* ----------------------------[private typedef]-----------------------------*/


typedef struct FLEXCAN2_tag flexcan_t;

