spark-empty/crash-as/com/as.infrastructure/arch/mpc56xx/mcal/Can.c
#if defined(CFG_CAN_TEST)
Can_TestType Can_Test;
#endif

typedef enum {
    CAN_UNINIT = 0, CAN_READY
} Can_DriverStateType;


/* Type for holding global information used by the driver */
typedef struct {
    Can_DriverStateType     initRun;            /* If Can_Init() have been run */
    const Can_ConfigType *  config;             /* Pointer to config */
    uint32                  configuredMask;     /* What units are configured */
} Can_GlobalType;


/* Type for holding information about each controller */
typedef struct {
    /* This unit have uses controller */
    CanControllerIdType                 controllerId;
    CanIf_ControllerModeType            state;
    const Can_ControllerConfigType *    cfgCtrlPtr;     /* Pointer to controller config  */
    const Can_HardwareObjectType *      cfgHohPtr;     /* List of HOHs */
    flexcan_t *                         hwPtr;
    uint32      lock_cnt;
    uint64      Can_Arc_RxMbMask;
    uint64      Can_Arc_TxMbMask;
    uint64      mbTxFree;
    uint8_t     mbMax;                              /* Max number of mailboxes used for this unit */
//    PduIdType   swPduHandles[MAX_NUM_OF_MAILBOXES]; /* Data stored for Txconfirmation callbacks to CanIf */
//    uint8_t     mbToHrh[MAX_NUM_OF_MAILBOXES];      /* Mapping from mailbox to HRH */
#if (USE_CAN_STATISTICS == STD_ON)
    Can_Arc_StatisticsType stats;
#endif
} Can_UnitType;

/* ----------------------------[private function prototypes]-----------------*/
static void Can_Isr(int unit);
static void Can_Err(int unit);
static void Can_BusOff(int unit);

/* ----------------------------[private variables]---------------------------*/

Can_UnitType    CanUnit[CAN_ARC_CTRL_CONFIG_CNT];
Can_GlobalType  Can_Global = { .initRun = CAN_UNINIT, };
/* Used by ISR */
//uint8_t         Can_CtrlToUnitMap[CAN_ARC_CTRL_CONFIG_CNT];
/* Used by Can_Write() */
//uint8_t         Can_HthToUnitIdMap[NUM_OF_HTHS];
//uint8_t         Can_HthToHohMap[NUM_OF_HTHS];

/* ----------------------------[private functions]---------------------------*/

static void clearMbFlag( flexcan_t * hw,  uint8_t mb ) {
    if( mb >= 32) {
#if defined(CFG_MPC563XM)
		if(hw==GET_CONTROLLER(FLEXCAN_A)){
	        hw->IFRH.R = (1<<(mb-32));
		}
#else
        hw->IFRH.R = (1<<(mb-32));
#endif
    } else {
        hw->IFRL.R = (1<<mb);
    }
}

static inline uint64_t ilog2_64( uint64_t val ) {
    uint32_t t = val >> 32;

    if( t != 0) {
        return ilog2(t) + 32;
    }
    return ilog2((uint32_t)val);
}


#if defined(CFG_MPC563XM)
void Can_A_Isr( void ) {Can_Isr(CAN_CTRL_A);}
void Can_C_Isr( void ) {Can_Isr(CAN_CTRL_C);}
void Can_A_Err( void ) {Can_Err(CAN_CTRL_A);}
void Can_C_Err( void ) {Can_Err(CAN_CTRL_C);}
void Can_A_BusOff( void ) {Can_BusOff(CAN_CTRL_A);}
void Can_C_BusOff( void ) {Can_BusOff(CAN_CTRL_C);}

#else

void Can_A_Isr( void ) {Can_Isr(CAN_CTRL_A);}
void Can_B_Isr( void ) {Can_Isr(CAN_CTRL_B);}

#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5567) || defined(CFG_MPC5668) || defined(CFG_MPC560XB)
void Can_C_Isr( void ) {Can_Isr(CAN_CTRL_C);}
void Can_D_Isr( void ) {Can_Isr(CAN_CTRL_D);}
void Can_E_Isr( void ) {Can_Isr(CAN_CTRL_E);}
#endif
#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5668) || defined(CFG_MPC560XB)
void Can_F_Isr( void ) {Can_Isr(CAN_CTRL_F);}
#endif

void Can_A_Err( void ) {Can_Err(CAN_CTRL_A);}
void Can_B_Err( void ) {Can_Err(CAN_CTRL_B);}
#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5567) || defined(CFG_MPC5668) || defined(CFG_MPC560XB)
void Can_C_Err( void ) {Can_Err(CAN_CTRL_C);}
void Can_D_Err( void ) {Can_Err(CAN_CTRL_D);}
void Can_E_Err( void ) {Can_Err(CAN_CTRL_E);}
#endif
#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5668) || defined(CFG_MPC560XB)
void Can_F_Err( void ) {Can_Err(CAN_CTRL_F);}
#endif

void Can_A_BusOff( void ) {Can_BusOff(CAN_CTRL_A);}
void Can_B_BusOff( void ) {Can_BusOff(CAN_CTRL_B);}
#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5567) || defined(CFG_MPC5668) || defined(CFG_MPC560XB)
void Can_C_BusOff( void ) {Can_BusOff(CAN_CTRL_C);}
void Can_D_BusOff( void ) {Can_BusOff(CAN_CTRL_D);}
void Can_E_BusOff( void ) {Can_BusOff(CAN_CTRL_E);}
#endif
#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5668) || defined(CFG_MPC560XB)
void Can_F_BusOff( void ) {Can_BusOff(CAN_CTRL_F);}
#endif

#endif /* defined(CFG_MPC563XM) */

//-------------------------------------------------------------------

#if defined(CFG_CAN_TEST)
Can_TestType * Can_Arc_GetTestInfo( void ) {
	return &Can_Test;
}
#endif

/**
 * Hardware error ISR for CAN
 *
 * @param unit CAN controller number( from 0 )
 */

static void Can_Err(int unit)
{
    flexcan_t *canHw = GET_CONTROLLER(unit);
    Can_Arc_ErrorType err;
    uint32 esr;

	err.R = 0;

    /* Clear bits 16-23 by read */
    esr = canHw->ESR.R;
    ASLOG(CAN, "CAN%d esr = %X\n", unit, esr);
    if( esr & ESR_ERRINT )
    {
		if (GET_CALLBACKS()->Arc_Error != NULL) {
			GET_CALLBACKS()->Arc_Error(unit, err);
		}

		Can_SetControllerMode(unit, CAN_T_STOP); // CANIF272 Same handling as for busoff
		// Clear ERRINT
		canHw->ESR.R = ESR_ERRINT;
    }
}

/**
 *
 * @param canHw
 * @param canUnit
 */
// Uses 25.4.5.1 Transmission Abort Mechanism
#if defined(CFG_MPC563XM)

static void Can_AbortTx(flexcan_t *canHw, Can_UnitType *canUnit)
{
    uint64_t mbMask;
	uint8 mbNr;
	// Find our Tx boxes.
	mbMask = canUnit->Can_Arc_TxMbMask;
	// Loop over the Mb's set to abort
	for (; mbMask; mbMask &= ~(1ull << mbNr)) {
		mbNr = ilog2_64(mbMask);
		canHw->BUF[mbNr].CS.B.CODE = MB_ABORT;
		// Did it take
		if (canHw->BUF[mbNr].CS.B.CODE != MB_ABORT) {
			// nope..
			/* it's not sent... or being sent.
			 * Just wait for it
			 */
			int i = 0;
		    volatile uint64_t iFlag;
			do{
			    if(canHw==GET_CONTROLLER(FLEXCAN_A)){
			    	iFlag = *(uint64_t *)(&canHw->IFRH.R);
			    }else{
			    	iFlag = (uint64_t)(*(uint32_t *)(&canHw->IFRL.R));
			    }
				i++;
				if (i > 1000) {
					break;
				}
			} while (iFlag & (1ull << mbNr));
		}

