spark-empty/crash-as/com/as.infrastructure/arch/mpc56xx/mcal/Can.c
		// Clear interrupt
		clearMbFlag(canHw,mbNr);
		canUnit->mbTxFree |= (1ull << mbNr);
	}
}

#else

static void Can_AbortTx(flexcan_t *canHw, Can_UnitType *canUnit)
{
 uint64_t mbMask;
    uint8 mbNr;
    // Find our Tx boxes.
    mbMask = canUnit->Can_Arc_TxMbMask;
    // Loop over the Mb's set to abort
    for (; mbMask; mbMask &= ~(1ull << mbNr)) {
        mbNr = ilog2_64(mbMask);
        canHw->BUF[mbNr].CS.B.CODE = MB_ABORT;
        // Did it take
        if (canHw->BUF[mbNr].CS.B.CODE != MB_ABORT) {
            // nope..
            /* it's not sent... or being sent.
             * Just wait for it
             */
            int i = 0;
            while (*(uint64_t *) (&canHw->IFRH.R) & (1ull << mbNr)) {
                i++;
                if (i > 1000) {
                    break;
                }
            }
        }

        // Clear interrupt
        clearMbFlag(canHw,mbNr);
        canUnit->mbTxFree |= (1ull << mbNr);
    }
}

#endif



/**
 * BusOff ISR for CAN
 *
 * @param unit CAN controller number( from 0 )
 */
static void Can_BusOff(int unit)
{
    flexcan_t *canHw = GET_CONTROLLER(unit);
    Can_UnitType *canUnit = CTRL_TO_UNIT_PTR(unit);
    Can_Arc_ErrorType err;
    err.R = 0;

#if (USE_CAN_STATISTICS == STD_ON)
    if (canHw->ESR.B.TWRNINT) {
        err.B.TXWRN = canHw->ESR.B.TXWRN;
        canUnit->stats.txErrorCnt++;
        canHw->ESR.B.TWRNINT = 1;
    }

    if (canHw->ESR.B.RWRNINT) {
        err.B.RXWRN = canHw->ESR.B.RXWRN;
        canUnit->stats.rxErrorCnt++;
        canHw->ESR.B.RWRNINT = 1;
    }
#endif

    if (canHw->ESR.B.BOFFINT) {
        ASLOG(CAN,"CAN%d bus off\n", unit);
#if (USE_CAN_STATISTICS == STD_ON)
        canUnit->stats.boffCnt++;
#endif
        if (GET_CALLBACKS()->ControllerBusOff != NULL) {
            GET_CALLBACKS()->ControllerBusOff(unit);
        }
        Can_SetControllerMode(unit, CAN_T_STOP); // CANIF272

        canHw->ESR.B.BOFFINT = 1;

        Can_AbortTx(canHw, canUnit); // CANIF273

        if (canHw->CR.B.BOFFREC) {
        	canHw->CR.B.BOFFREC = 0;
        	canHw->CR.B.BOFFREC = 1;
        }
    }
}

/**
 *
 * @param uPtr
 */
static void Can_Isr_Tx(Can_UnitType *uPtr)
{
    uint8 mbNr;
    flexcan_t *canHw;
    PduIdType pduId;


    canHw = uPtr->hwPtr;

#if defined(CFG_MPC563XM)
    uint64_t mbMask;
    if(canHw==GET_CONTROLLER(FLEXCAN_A)){
    	mbMask = *(uint64_t *)(&canHw->IFRH.R);
    }else{
    	mbMask = (uint64_t)(*(uint32_t *)(&canHw->IFRL.R));
    }
#else
    uint64_t mbMask = *(uint64_t *) (&canHw->IFRH.R);
#endif
    mbMask &= uPtr->Can_Arc_TxMbMask;

    /*
     * Tx
     */
#if defined(CFG_CAN_TEST)
    Can_Test.mbMaskTx |= mbMask;
#endif


    for (; mbMask; mbMask &= ~(1ull << mbNr)) {
        mbNr = ilog2_64(mbMask);

        pduId = uPtr->cfgCtrlPtr->Can_Arc_TxPduHandles[mbNr-uPtr->cfgCtrlPtr->Can_Arc_TxMailboxStart];
        uPtr->cfgCtrlPtr->Can_Arc_TxPduHandles[mbNr-uPtr->cfgCtrlPtr->Can_Arc_TxMailboxStart] = 0;

        // Clear interrupt and mark txBox as Free
        clearMbFlag(canHw,mbNr);
        uPtr->mbTxFree |= (1ull << mbNr);

        if (GET_CALLBACKS()->TxConfirmation != NULL) {
            GET_CALLBACKS()->TxConfirmation(pduId);
        }
    }
}

static void Can_Isr_Rx(Can_UnitType *uPtr)
{
    uint8 mbNr;
    uint32 id;
    uint32 mask;
    uint32 tmp = 0;

    flexcan_t *canHw;
    const Can_HardwareObjectType *hohPtr;

    canHw = uPtr->hwPtr;

#if defined(CFG_MPC563XM)
    uint64_t iFlag;
    if(canHw==GET_CONTROLLER(FLEXCAN_A)){
    	iFlag = *(uint64_t *)(&canHw->IFRH.R);
    }else{
    	iFlag = (uint64_t)(*(uint32_t *)(&canHw->IFRL.R));
    }
#else
    uint64_t iFlag = *(uint64_t*) (&canHw->IFRH.R);
#endif

#if defined(CFG_CAN_TEST)
    Can_Test.mbMaskRx |= iFlag & uPtr->Can_Arc_RxMbMask;
#endif

    while (iFlag & uPtr->Can_Arc_RxMbMask) {

        /* Find mailbox */
        mbNr = ilog2_64(iFlag & uPtr->Can_Arc_RxMbMask);

        /* Check for FIFO interrupt */
        if (canHw->MCR.B.FEN && ((uint32_t)iFlag & (1 << 5))) {

        	tmp++;
//        	if( tmp > 2) {
//        		while(1){}
//        	}

            /* Check overflow */
            if (iFlag & (1 << 7)) {
#if (USE_CAN_STATISTICS == STD_ON)
                uPtr->stats.fifoOverflow++;
#endif
                clearMbFlag(canHw, 7);
                DET_REPORTERROR(MODULE_ID_CAN,0,0, CAN_E_DATALOST); /** @req 4.0.3/CAN395 */
            }

#if (USE_CAN_STATISTICS == STD_ON)
            /* Check warning */
            if (iFlag & (1 << 6)) {
                uPtr->stats.fifoWarning++;
                clearMbFlag(canHw, 6);
            }
#endif

            /* The manual is "fuzzy" here, read control and status */
            (void) canHw->BUF[0].CS.R;

            if (canHw->BUF[0].CS.B.IDE) {
                id = canHw->BUF[0].ID.R;
                id |= 0x80000000;
            } else {
                id = canHw->BUF[0].ID.B.STD_ID;
            }

            /* Must now do a manual match to find the right CanHardwareObject
             * to pass to CanIf. We know that the FIFO objects are sorted first.
             */
            hohPtr = uPtr->cfgCtrlPtr->Can_Arc_Hoh;

            /* Match in order */
            vuint32_t *fifoIdPtr = (vuint32_t *) &canHw->BUF[6];


            for (uint8 fifoNr = 0; fifoNr < uPtr->cfgCtrlPtr->Can_Arc_HohFifoCnt; fifoNr++) {
                mask = canHw->RXIMR[fifoNr].R;

                if ((id & mask) != (fifoIdPtr[fifoNr] & mask)) {
                    continue;
                }

                if (GET_CALLBACKS()->RxIndication != NULL) {
                    GET_CALLBACKS()->RxIndication(uPtr->cfgCtrlPtr->Can_Arc_MailBoxToHrh[fifoNr],
                    		id,
                            canHw->BUF[0].CS.B.LENGTH,
                            (uint8 *) &canHw->BUF[0].DATA.W[0]);
                }
                break;
            }

            // Clear the interrupt
            clearMbFlag(canHw, 5);
            if( canHw->IFRL.B.BUF05I == 0 ) {
                iFlag ^= 1ull << mbNr;
            }

        } else {
            /* Not FIFO */
            iFlag ^= 1ull << mbNr;


