spark-empty/crash-as/com/as.infrastructure/arch/mpc56xx/mcal/Can.c
    return rv;
}

void Can_DisableControllerInterrupts(uint8 controller)
{
    /** @req 3.1.5/CAN231 */
    /** @req 3.1.5/CAN202 */
    /** !req 3.1.5/CAN204 */
    /** !req 3.1.5/CAN292 */

	VALIDATE_NO_RV( (Can_Global.initRun == CAN_READY), CAN_DISABLECONTROLLERINTERRUPTS_SERVICE_ID, CAN_E_UNINIT );
    /** @req 3.1.5/CAN206 */
    VALIDATE_NO_RV( VALID_CONTROLLER(controller) , CAN_DISABLECONTROLLERINTERRUPTS_SERVICE_ID, CAN_E_PARAM_CONTROLLER );
    Can_UnitType *canUnit = CTRL_TO_UNIT_PTR(controller);
    flexcan_t *canHw;
    imask_t state;

    /** @req 3.1.5/CAN205 */
    VALIDATE_NO_RV( (canUnit->state!=CANIF_CS_UNINIT), CAN_DISABLECONTROLLERINTERRUPTS_SERVICE_ID, CAN_E_UNINIT );



    Irq_Save(state);
    /** @req 3.1.5/CAN049 */
    if (canUnit->lock_cnt > 0) {
        // Interrupts already disabled
        canUnit->lock_cnt++;
        Irq_Restore(state);
        return;
    }
    canUnit->lock_cnt++;
    Irq_Restore(state);

    /* Don't try to be intelligent, turn everything off */
    canHw = GET_CONTROLLER(controller);

    /* Turn off the interrupt mailboxes */
#if defined(CFG_MPC563XM)
    if(controller==FLEXCAN_A){
        canHw->IMRH.R = 0;
    }
    canHw->IMRL.R = 0;
#else
    canHw->IMRH.R = 0;
    canHw->IMRL.R = 0;
#endif

    /* Turn off the bus off/tx warning/rx warning and error */
    canHw->MCR.B.WRNEN = 0; /* Disable warning int */
    canHw->CR.B.ERRMSK = 0; /* Disable error interrupt */
    canHw->CR.B.BOFFMSK = 0; /* Disable bus-off interrupt */
    canHw->CR.B.TWRNMSK = 0; /* Disable Tx warning */
    canHw->CR.B.RWRNMSK = 0; /* Disable Rx warning */
}

void Can_EnableControllerInterrupts(uint8 controller)
{
    /** @req 3.1.5/CAN232 */
    /** @req 3.1.5/CAN050 */
    /** !req 3.1.5/CAN293 Not applicable */

    Can_UnitType *canUnit;
    flexcan_t *canHw;
    imask_t state;

    /** @req 3.1.5/CAN209 */
	VALIDATE_NO_RV( (Can_Global.initRun == CAN_READY), CAN_ENABLECONTROLLERINTERRUPTS_SERVICE_ID, CAN_E_UNINIT );
    /** @req 3.1.5/CAN210 */
    VALIDATE_NO_RV( VALID_CONTROLLER(controller), CAN_ENABLECONTROLLERINTERRUPTS_SERVICE_ID, CAN_E_PARAM_CONTROLLER );
    canUnit = CTRL_TO_UNIT_PTR(controller);
    VALIDATE_NO_RV( (canUnit->state!=CANIF_CS_UNINIT), CAN_ENABLECONTROLLERINTERRUPTS_SERVICE_ID, CAN_E_UNINIT );

    Irq_Save(state);
    if (canUnit->lock_cnt > 1) {
        /** @req 3.1.5/CAN208 */
        // IRQ should still be disabled so just decrement counter
        canUnit->lock_cnt--;
        Irq_Restore(state);
        return;
    } else if (canUnit->lock_cnt == 1) {
        canUnit->lock_cnt = 0;
    }
    Irq_Restore(state);

    canHw = canUnit->hwPtr;

#if defined(CFG_MPC563XM)
    if(controller==FLEXCAN_A){
        canHw->IMRH.R = 0;
    }
    canHw->IMRL.R = 0;
#else
    canHw->IMRH.R = 0;
    canHw->IMRL.R = 0;
#endif

    if (canUnit->cfgCtrlPtr->Can_Arc_Flags & CAN_CTRL_RX_PROCESSING_INTERRUPT ) {
        /* Turn on the interrupt mailboxes */
#if defined(CFG_MPC563XM)
        canHw->IMRL.R = canUnit->Can_Arc_RxMbMask;
		if(controller==FLEXCAN_A){
	        canHw->IMRH.R = (uint32_t)(canUnit->Can_Arc_RxMbMask>>32);
		}
#else
        canHw->IMRL.R = canUnit->Can_Arc_RxMbMask;
        canHw->IMRH.R = (uint32_t)(canUnit->Can_Arc_RxMbMask>>32);
#endif
    }

    if (canUnit->cfgCtrlPtr->Can_Arc_Flags &  CAN_CTRL_TX_PROCESSING_INTERRUPT) {
        /* Turn on the interrupt mailboxes */
#if defined(CFG_MPC563XM)
        canHw->IMRL.R |= canUnit->Can_Arc_TxMbMask;
		if(controller==FLEXCAN_A){
	        canHw->IMRH.R |= (uint32_t)(canUnit->Can_Arc_TxMbMask>>32);
		}
#else
        canHw->IMRL.R |= canUnit->Can_Arc_TxMbMask;
        canHw->IMRH.R |= (uint32_t)(canUnit->Can_Arc_TxMbMask>>32);
#endif
    }

    // BusOff and warnings
    if (canUnit->cfgCtrlPtr->Can_Arc_Flags &  CAN_CTRL_BUSOFF_PROCESSING_INTERRUPT) {
        canHw->MCR.B.WRNEN = 1; /* Turn On warning int */
        canHw->CR.B.BOFFMSK = 1; /* Enable bus-off interrupt */

#if (USE_CAN_STATISTICS == STD_ON)
        canHw->CR.B.TWRNMSK = 1; /* Enable Tx warning */
        canHw->CR.B.RWRNMSK = 1; /* Enable Rx warning */
#endif
    }

    // errors
    if (canUnit->cfgCtrlPtr->Can_Arc_Flags &  CAN_CTRL_ERROR_PROCESSING_INTERRUPT) {
        canHw->CR.B.ERRMSK = 1; /* Enable error interrupt */
    }

    return;
}

Can_ReturnType Can_Write(Can_Arc_HTHType hth, Can_PduType *pduInfo)
{
    /** @req 3.1.5/CAN223 */
    /** !req 3.1.5/CAN213 Priorities not supported */
    /** !req 3.1.5/CAN215 Priorities not supported */
    /** @req 3.1.5/CAN214 */
    /** @req 3.1.5/CAN272 */

    uint16_t timer;
    uint64_t iflag;
    Can_ReturnType rv = CAN_OK;
    uint32_t mbNr;
    flexcan_t *canHw;
    const Can_HardwareObjectType *hohObj;
    Can_UnitType *canUnit;
    imask_t state;

    /** @req 3.1.5/CAN216 */
    VALIDATE( (Can_Global.initRun == CAN_READY), 0x6, CAN_E_UNINIT );
    /** @req 3.1.5/CAN219 */
    VALIDATE( (pduInfo != NULL), 0x6, CAN_E_PARAM_POINTER );
    /** @req 3.1.5/CAN218 */
    VALIDATE( (pduInfo->length <= 8), 0x6, CAN_E_PARAM_DLC );
    /** @req 3.1.5/CAN217 */
    VALIDATE( (hth < NUM_OF_HTHS ), 0x6, CAN_E_PARAM_HANDLE );

    canUnit = &CanUnit[Can_Global.config->CanConfigSet->ArcHthToUnit[hth]];
    hohObj  =  &canUnit->cfgHohPtr[Can_Global.config->CanConfigSet->ArcHthToHoh[hth]];
    canHw   =  canUnit->hwPtr;

    /* We have the hohObj, we need to know what box we can send on */
    Irq_Save(state);
    /* Get all free TX mboxes */
#if defined(CFG_MPC563XM)
    uint64_t iHwFlag;
    if(canHw==GET_CONTROLLER(FLEXCAN_A)){
        iHwFlag = *(uint64_t *)(&canHw->IFRH.R);  /* These are occupied */
    }else{
        iHwFlag = (uint64_t)(*(uint32_t *)(&canHw->IFRL.R));  /* These are occupied */
    }
#else
    uint64_t iHwFlag = *(uint64_t *)(&canHw->IFRH.R);  /* These are occupied */
#endif
    asAssert( (canUnit->Can_Arc_TxMbMask & hohObj->ArcMailboxMask) != 0);
    iflag = ~iHwFlag &  canUnit->mbTxFree & hohObj->ArcMailboxMask;
    /* Get the mbox(es) for this HTH */

    /** @req 3.1.5/CAN212 */
    if (iflag ) {
        mbNr = ilog2_64(iflag ); // find mb number

        /* Indicate that we are sending this MB */
        canUnit->mbTxFree &= ~(1ull<<mbNr);

        canHw->BUF[mbNr].CS.R = 0;
        canHw->BUF[mbNr].ID.R = 0;

