spark-empty/crash-as/com/as.infrastructure/arch/mpc56xx/mcal/Can.c
        // Setup message box type
        if (hohObj->CanIdType == CAN_ID_TYPE_EXTENDED) {
            canHw->BUF[mbNr].CS.B.IDE = 1;
        } else if (hohObj->CanIdType == CAN_ID_TYPE_STANDARD) {
            canHw->BUF[mbNr].CS.B.IDE = 0;
        } else {
            // No support for mixed in this processor
            asAssert(0);
        }

        // Send on buf
        canHw->BUF[mbNr].CS.B.CODE = MB_INACTIVE; // Hold the transmit buffer inactive
        if (hohObj->CanIdType == CAN_ID_TYPE_EXTENDED) {
            canHw->BUF[mbNr].ID.R = pduInfo->id; // Write 29-bit MB IDs
        } else {
            asAssert( !(pduInfo->id & 0xfffff800) );
            canHw->BUF[mbNr].ID.B.STD_ID = pduInfo->id;
        }

#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5606S) || defined(CFG_MPC560XB) || defined(CFG_MPC5668) || defined(CFG_MPC5604P)
        canHw->BUF[mbNr].ID.B.PRIO = 1; // Set Local Priority
#endif

        memset(&canHw->BUF[mbNr].DATA, 0, 8);
        memcpy(&canHw->BUF[mbNr].DATA, pduInfo->sdu, pduInfo->length);

        canHw->BUF[mbNr].CS.B.SRR = 1;
        canHw->BUF[mbNr].CS.B.RTR = 0;

        canHw->BUF[mbNr].CS.B.LENGTH = pduInfo->length;
        canHw->BUF[mbNr].CS.B.CODE = MB_TX_ONCE; // Write tx once code
        timer = canHw->TIMER.R; // Unlock Message buffers

#if (USE_CAN_STATISTICS == STD_ON)
        canUnit->stats.txSuccessCnt++;
#endif

        // Store pdu handle in unit to be used by TxConfirmation
        canUnit->cfgCtrlPtr->Can_Arc_TxPduHandles[mbNr-canUnit->cfgCtrlPtr->Can_Arc_TxMailboxStart] = pduInfo->swPduHandle;

    } else {
        rv = CAN_BUSY;
    }
    Irq_Restore(state);

    return rv;
}

void Can_Cbk_CheckWakeup( uint8 controller ) {
    /** !req 3.1.5/CAN360 */
    /** !req 3.1.5/CAN361 */
    /** !req 3.1.5/CAN362 */
    /** !req 3.1.5/CAN363 */

    /* NOT SUPPORTED */
	(void)controller;
}


void Can_MainFunction_Write( void ) {
    /** !req 3.1.5/CAN225 */
    /** !req 3.1.5/CAN031 */
    /** !req 3.1.5/CAN178 */
    /** !req 3.1.5/CAN179 */
    Can_UnitType *uPtr;

    for(int i=0;i<CAN_ARC_CTRL_CONFIG_CNT; i++ ) {
        uPtr = &CanUnit[i];
        if( (uPtr->cfgCtrlPtr->Can_Arc_Flags & CAN_CTRL_TX_PROCESSING_INTERRUPT) == 0 ) {
            Can_Isr_Tx(uPtr);
        }
    }
}

void Can_MainFunction_Read(void)
{
    /** !req 3.1.5/CAN226 */
    /** !req 3.1.5/CAN108 */
    /** !req 3.1.5/CAN180 */
    /** !req 3.1.5/CAN181 */
    Can_UnitType *uPtr;

    for(int i=0;i<CAN_ARC_CTRL_CONFIG_CNT; i++ ) {
        uPtr = &CanUnit[i];
        if( (uPtr->cfgCtrlPtr->Can_Arc_Flags & CAN_CTRL_RX_PROCESSING_INTERRUPT) == 0 ) {
            Can_Isr_Rx(uPtr);
        }
    }
}

void Can_MainFunction_BusOff(void)
{
    /** !req 3.1.5/CAN227 */
    /** !req 3.1.5/CAN109 */
    /** !req 3.1.5/CAN183 */
    /** !req 3.1.5/CAN184 */
    /* Bus-off polling events */
    Can_UnitType *uPtr;

    for(int i=0;i<CAN_ARC_CTRL_CONFIG_CNT; i++ ) {
        uPtr = &CanUnit[i];
        if( (uPtr->cfgCtrlPtr->Can_Arc_Flags & CAN_CTRL_BUSOFF_PROCESSING_INTERRUPT) == 0 ) {
        	Can_BusOff(uPtr->controllerId);
        }
    }
}

void Can_MainFunction_Error(void)
{
    /** !req 3.1.5/CAN227 */
    /** !req 3.1.5/CAN109 */
    /** !req 3.1.5/CAN183 */
    /** !req 3.1.5/CAN184 */
    /* Error polling events */
    Can_UnitType *uPtr;

    for(int i=0;i<CAN_ARC_CTRL_CONFIG_CNT; i++ ) {
        uPtr = &CanUnit[i];
        if( (uPtr->cfgCtrlPtr->Can_Arc_Flags & CAN_CTRL_ERROR_PROCESSING_INTERRUPT) == 0 ) {
        	Can_Err(uPtr->controllerId);
        }
    }
}

void Can_MainFunction_Wakeup(void)
{
    /** !req 3.1.5/CAN228 */
    /** !req 3.1.5/CAN112 */
    /** !req 3.1.5/CAN185 */
    /** !req 3.1.5/CAN186 */
    /* Wakeup polling events */

    /* NOT SUPPORTED */
}

#if 0
Can_Arc_ProcessType Can_Arc_ProcessingMode( uint8 controller ) {
    Can_UnitType *uPtr = &CanUnit[controller];


    if(uPtr->cfgCtrlPtr->Can_Arc_Flags & CAN_CTRL_TX_PROCESSING_INTERRUPT ){
        Can_Isr_Tx(uPtr);
    }

}
#endif


#if (USE_CAN_STATISTICS == STD_ON)
/**
 * Get send/receive/error statistics for a controller
 *
 * @param controller The controller
 * @param stats Pointer to data to copy statistics to
 */


void Can_Arc_GetStatistics(uint8 controller, Can_Arc_StatisticsType *stats)
{
	if(Can_Global.initRun == CAN_READY)
	{
		Can_UnitType *canUnit = CTRL_TO_UNIT_PTR(controller);
		*stats = canUnit->stats;
	}
}
#endif

#ifdef USE_SHELL
#include "shell.h"
void statCan(void)
{
	Can_UnitType *uPtr;
	if(Can_Global.initRun == CAN_READY)
	{
		for(int i=0;i<CAN_ARC_CTRL_CONFIG_CNT; i++ ) {
			uPtr = &CanUnit[i];
			SHELL_printf("CAN%d state is %d\n"
					"  txSuccessCnt=%d, rxSuccessCnt=%d,\n"
					"  txErrorCnt=%d, rxErrorCnt=%d,\n"
					"  busOffCnt=%d, fifoOverflow=%d, fifoWarning=%d\n",
					i, uPtr->state,
					uPtr->stats.txSuccessCnt,
					uPtr->stats.rxSuccessCnt,
					uPtr->stats.txErrorCnt,
					uPtr->stats.rxErrorCnt,
					uPtr->stats.boffCnt,
					uPtr->stats.fifoOverflow,
					uPtr->stats.fifoWarning);
		}
	}
}
#endif

